{"posts":{"2018-02-23-hello-world":{"card.png":{"file":"/posts/2018-02-23-hello-world/card.png","dir":"/posts/2018-02-23-hello-world","name":"card","base":"card.png","ext":".png","width":290,"height":335},"index.md":{"file":"/posts/2018-02-23-hello-world/index.md","dir":"/posts/2018-02-23-hello-world","name":"index","base":"index.md","ext":".md","attr":{"title":"Hello World","date":"2018-02-23T00:00:00.000Z","tags":["static files","react","redux","boilerplate","github pages","yarn","webpack","filestojson","markdown","frontmatter"]},"body":"\nHello there! Welcome to my personal (and professional) website.\n\n\"What this site have of special\", you might wonder... 🙋\n\nFirstly, well, it's my website, yey! 😃\n\nIt's cooler than that, I'll try to keep a good content for you to read, but the starting point here another. I'm a web developer, specialized on front end development. Yeah, I do the code that return as your experience. At the moment of I'm writting this, the project is on it's early days and I wanted to keep the visual minimalistic. I like that, but maybe this changes in the future, let's see.\n\nAlright let's see what's the big deal here:\n\n- It's open source [github.com/bernardodiasc/bernardodiasc.github.io](https://github.com/bernardodiasc/bernardodiasc.github.io)\n- The content is based on static files [github.com/bernardodiasc/filestojson](https://github.com/bernardodiasc/filestojson)\n- The framework is quite powerful [bernardodiasc.github.io/docs/](https://bernardodiasc.github.io/docs/)\n\nBeing a front end developer, there's a lot to do for a project to be awesome. Starting with the fact that a framework is the whole set of tools and techniques the involves the project. Yeah I could use something that's ready in the community, and I did used many different options for different cases, you could suggest a static file generator like Jekyll and there's a big chance that I've used your suggestion too, but right here, I made my own framework, because It's cool, because it's the way I want, because I need to showcase that I know what I'm doing for people to hite me! 😁\n\nThe `filestojson` script was made for [https://x-team.com/legacy/](https://x-team.com/legacy/) in it's first version, at that moment the whole site had html static files generators and npm tasks to build the assets. In the second version I kept the content generator and upgraded the template render to React. Because React is awesome and it makes development experience a breeze.\n\nMost problems I found in the second version was basicaly related to make a single-page application to behave well in a static-file server. My first time doing this, I give a try on Gasby and Next.js, but hey, I still wanted to make something myself, so I kept the Creat-React-App setup and installed [github.com/stereobooster/react-snap](https://github.com/stereobooster/react-snap). Sweet! It worked very well.\n\nFor the workflow I prepared a whole bunch of cool tooling, patterns and procedures. I enjoy to work for large scale project, so in this framework I used the entire arsenal recommended for big apps. You can see it in the main README of this site, but let me list them here:\n\n- Setup: `yarn install`\n- Development: `yarn start` then open http://localhost:3000/\n- Documentation with Storybook: `yarn docs` then open http://localhost:9009/\n- Content generator: `yarn content`\n- Component generator: `yarn component`\n- ESLint and StyleLint: `yarn lint`\n- Tests with Jest: `yarn test`\n- Build static files: `yarn build`\n- Static server: `yarn serve` then open http://localhost:5000/\n- Deploy project: `yarn deploy` then run `npm docs`\n\n😆\n\nNotice that it's everything simple, type \"yarn something\" and voilà! The setup is trivial, development is a breeze. It provided complete patterns for documentation and showcase of the components using Storybooks, and also includes a component generator that comes with all the boilerplate. Linters and tests suites, yeah, I've got covered that too. You can build and up a local static server to see how it's working. And finally, easy deployment. In the attempt to commit changes, the robot will prevent most as possible the introduction of wrong code or bugs (if properly tested).\n\nFor the CSS I kept pure. Yeah, I like Sass, I like even more PostCSS and CSS Modules, and Styled-components. But I choose pure CSS here and I'm happy with.\n\nSo, yeah, a lot of this was made above CRA features. But make sure you get the idea that I've been doing this kind of stuff much before CRA existence. All the tooling are here to help, to make the development experience better, reliable, faster.\n\nThanks for reading my blog, I'll do my best to post and evolve the system more.\n"},"poster.png":{"file":"/posts/2018-02-23-hello-world/poster.png","dir":"/posts/2018-02-23-hello-world","name":"poster","base":"poster.png","ext":".png","width":1600,"height":988}}}}